import { Accordion, AccordionContent, AccordionItem, AccordionTrigger } from '@/components/ui/accordion';
import { Card, CardContent } from '@/components/ui/card';
import React from 'react';
import Image from 'next/image';

interface Doctor {
  name: string;
  description: string;
  time?: string;
}

// Doctor data grouped by specialization
const doctors: Record<string, Doctor[]> = {
  'পরিপাকতন্ত্র ও লিভার রোগ বিশেষজ্ঞ': [
    {
      name: 'ডা. আল মাহমুদ এ্যাপোলো',
      description: 'এমবিবিএস (ডিএমসি), বিসিএস (স্বাস্থ্য) এমডি (গ্যাস্ট্রোএন্টোরোলজী) \nপরিপাকতন্ত্র ও লিভার রোগ বিশেষজ্ঞ কনসালটেন্ট, গ্যাস্ট্রোএন্টোরোলজী\nজাতীয় গ্যাস্ট্রোলিভার ইনস্টিটিউট ও হাসপাতাল, মহাখালী, ঢাকা',
      time: 'রাত ৮টা থেকে রাত ৯:৩০মি: (রবি, মঙ্গল ও বৃহস্পতিবার)',
    },
  ],
  'প্রসূতি ও স্ত্রীরোগ বিশেষজ্ঞ': [
    {
      name: 'ডা. ফারহানা মিথিলা',
      description: 'এমবিবিএস, এফসিপিএস প্রসূতি ও স্ত্রীরোগ বিশেষজ্ঞ \nল্যাপারোস্কোপিক সার্জন\n বন্ধ্যাত্ব বিষয়ে উচ্চতর প্রশিক্ষণপ্রাপ্ত\nঢাকা মেডিকেল কলেজ হাসপাতাল',
      time: 'সন্ধ্যা ৭টা থেকে রাত ৯টা (শনি, রবি, মঙ্গল ও বৃহস্পতিবার)',
    },
    {
      name: 'ডা. মোরশেদা পারভীন',
      description: 'এমবিবিএস, এফসিপিএস (অবস্ এন্ড গাইনী) \nপ্রসূতি ও স্ত্রীরোগ এবং বন্ধ্যাত্বরোগ বিশেষজ্ঞ, বিএমডিসি রেজি: নং এ- ৪২৯০৮',
      time: 'সকাল ১০টা-দুপুর ১২টা (রবি, মঙ্গল ও বৃহস্পতিবার)',
    },
    {
      name: 'ডা. লুসিয়াত জাহান',
      description: 'এমবিবিএস (আরইউ), ডিএমইউ, সিএমইউ, প্রাক্তন-ক্লিনিক ম্যানেজার (ইউপিএইচসিএসডিপি-২)\n(আরবান প্রাইমারী হেলথ কেয়ার সার্ভিসেস ডেলিভারি প্রোজেক্ট-২)\nপ্রাক্তন-মেডিকেল অফিসার\nসূর্যের হাসি ক্লিনিক',
      time: 'সকাল ১০টা-দুপুর ১২টা (শনি, সোম ও বুধবার)',
    },
    {
      name: 'ডা. ফারহানা ফেরদৌস',
      description: 'এমবিবিএস, বিসিএস (স্বাস্থ্য), ডিজিও (গাইনি-অবস্‌), এফসিপিএস (গাইনি-অবস্‌, এফপি)\nশহীদ সোহরাওয়ার্দী মেডিকেল কলেজ ও হাসপাতাল,শের-ই-বাংলা নগর, ঢাকা।',
      time: '',
    },
  ],
  'সনোলজিস্ট': [
    {
      name: 'ডা. জিনিয়া আফরিন খান',
      description: 'এমবিবিএস (ঢাকা), সিসিডি (বারডেম), ডিএমইডি \nসহকারী অধ্যাপক, ন্যাশনাল ইনস্টিটিউট অব নিউক্লিয়ার মেডিসিন এন্ড এ্যালাইড সাইন্সেস, বাংলাদেশ পরমাণু শক্তি কমিশন।',
      time: 'রাত ৮টা থেকে রাত ১০টা (শনি, সোম ও বৃহস্পতিবার)',
    },
      {
      name: 'ডা.ফারজানা রহমান',
      description: 'এমবিবিএস, ডিএমইডি, ডিডিএমইডি, সিসিডি, কালার ডপলার, ফিটাল এনোমালি ও টিএফএ (প্রশিক্ষণপ্রাপ্ত) কনসালট্যান্ট সোনোলজিস্ট, আশ-শাফি মেডিকেল সেন্টার',
      time: '',
    },
      {
      name: 'ডা. শাহানা আক্তার',
      description: 'এমবিবিএস, ডিডিএমইডি, এমডিএমইডি, সিসিডি, অ্যাডভান্সড ট্রেনিং অন এনোমালি স্ক্যান টিএফএ, ব্রেস্ট, থাইরয়েড ও এমএসকে, কনসালট্যান্ট সোনোলজিস্ট, আশ-শাফি মেডিকেল সেন্টার',
      time: '',
    },
  ],
  'মেডিসিন ও ডায়াবেটিস বিশেষজ্ঞ': [
    {
      name: 'ডা. নাহিদ ফারহানা চৌধুরী',
      description: 'এমবিবিএস (ঢাকা) এফসিজিপি, সিসিডি (বারডেম), ডিএমইউ \nকনসালটেন্ট\nফ্যামিলি মেডিসিন ও ডায়াবেটিস বিশেষজ্ঞ\nপ্রাক্তন ক্লিনিক ইনচার্জ, সূর্যের হাসি ক্লিনিক',
      time: '',
    },
    {
      name: 'ডা. মোঃ তানজীর আনোয়ার',
      description: 'এমবিবিএস, বিসিএস (স্বাস্থ্য), এফসিজিপি সিসিডি (বারডেম), সি-কার্ড (ন্যাশনাল হার্ট ফাউন্ডেশন) সিডিডি (আইসিডিডিআরবি) এমডি (ইন্টারনাল মেডিসিন) (অন কোর্স)\nজনস্বাস্থ্য পুষ্টি প্রতিষ্ঠান, ঢাকা',
      time: 'বিকেল ৫টা থেকে সন্ধ্যা ৭টা (শুক্রবার বন্ধ)',
    },
    {
      name: 'ডা. মুহম্মদ যুবায়ের চৌধুরী',
      description: 'এমবিবিএস, সিসিডি (বারডেম), এমপিএইচ \nকনসালটেন্ট পাবলিক হেলথ্ এবং ডায়াবেটোলজিস্ট\n ল্যাব এইড কার্ডিয়াক হাসপাতাল',
      time: 'সকাল ১০টা থেকে দুপুর ১টা (শনি, রবি, মঙ্গল ও বৃহস্পতিবার)',
    },
  ],

  'জেনারেল, ল্যাপারোস্কোপ, হার্নিয়া, ব্রেস্ট এন্ড ট্রমা সার্জারী বিশেষজ্ঞ': [
    {
      name: 'ডা. মোস্তাক আহমেদ',
      description: 'এমবিবিএস, এফসিপিএস (সার্জারী) \nজেনারেল, ল্যাপারোস্কোপ, হার্নিয়া, ব্রেস্ট এন্ড ট্রমা সার্জারী বিশেষজ্ঞ,ঢাকা মেডিকেল কলেজ হাসপাতাল',
      time: 'সন্ধ্যা ৭টা থেকে রাত ৯টা (রবি, মঙ্গল ও বৃহস্পতিবার)',
    },
    {
      name: 'ডা. মোঃ মাহমুদুল হাসান (মিঠু)',
      description: 'এমবিবিএস, বিসিএস (স্বাস্থ্য), এফসিপিএস (সার্জারি), এফসিপিএস (সার্জিক্যাল অনকোলজি) কোর্স\nকনসালট্যান্ট (সার্জারি),জাতীয় ক্যান্সার গবেষণা ইনস্টিটিউট ও হাসপাতাল,মহাখালী, ঢাকা',
      time: '',
    },
  ],
  'হৃদরোগ ও মেডিসিন বিশেষজ্ঞ': [
    {
      name: 'ডা.মাহমুদ হাসান',
      description: 'এমবিবিএস, বিসিএস (স্বাস্থ্য), এমডি কার্ডিওলজি (অন কোর্স), পিজিটি (মেডিসিন) \nজাতীয় হৃদরোগ ইনস্টিটিউট, ঢাকা\nবিএমডিসি রেজি: নং এ-১০৯৫২৮',
      time: 'সন্ধ্যা ৬টা থেকে রাত ৮টা (শনি, রবি, মঙ্গল ও বুধবার)',
    },
     {
      name: 'ডা.মোহাম্মদ ইব্রাহীম আদহাম',
      description: 'এমবিবিএস (ডিএমসি), এমএস রেসিডেন্ট (সিভিটিএস, এনএইচএফএইচ এন্ড আরআই) এফসিপিএস পার্ট-২ ট্রেইনি (সার্জারী), এমআরসিএস ওএসসিই (ইডেনবার্গ), সিসিডি (বারডেম) বিশেষ প্রশিক্ষণপ্রাপ্ত ইকো, ফুটকেয়ার ও ইনজুরি ব্যবস্থাপনা, প্রাক্তন এসআরএমও, ল্যাব এইড কার্ডিয়াক হাসপাতাল ',
      time: 'বিকেল ৪টা-রাত ৯টা (রবি, মঙ্গল, বৃহস্পতি ও শুক্রবার)',
    },
  ],
    'নবজাতক, শিশু ও কিশোর রোগ বিশেষজ্ঞ': [
    {
      name: 'ডা.মোঃ মাজহারুল হক',
      description: 'এমবিবিএস (সিলেট মেডিকেল কলেজ) ডিসিএইচ (ঢাকা শিশু হাসপাতাল, শ্যামলী) পিজিপিএন (বোষ্টন ইউনিভার্সিটি) ফেলোশিপ, শিশু পুষ্টি (আমেরিকা)\nকনসালটেন্ট, পেডিয়াট্রিক্স ও এনআইসিইউ\nওজিএসবি হাসপাতাল, মিরপুর-১৩, ঢাকা-১২১৬',
      time: 'রাত ৮টা থেকে ১০টা পর্যন্ত (শনি, সোম ও বুধবার)'
    },
     {
      name: 'ডা. মোহাম্মদ মাসুদ রানা',
      description: 'এমবিবিএস (ঢাকা), পিজিটি (চাইল্ড মেডিসিন) পিজিপিএন পোষ্ট গ্রাজুয়েশন ইন পেডিয়াট্রিক নিউট্রিশন, সিসিডি (হার্ট ফাউন্ডেশন), সিসিডি (বারডেম) \nশিশু চিকিৎসক ও জেনারেল,ফিজিশিয়ান প্রাক্তন সিনিয়র মেডিকেল অফিসার \nইনস্টিটিউট অব চাইল্ড হেলথ্ এন্ড শিশু ফাউন্ডেশন হাসপাতাল',
      time: 'সকাল ৯টা থেকে দুপুর ১১টা (শুক্রবার বন্ধ)',
    },
    {
      name: 'প্রফেসর চৌধুরী মোহাঃ হায়দার আলী',
      description: 'এমবিবিএস (ডিএমসি) ডিসিএইচ (Dublin), আরসিপিএন্ডএস (Ireland), এমডি (শিশু-বাংলাদেশ শিশু ইনস্টিটিউট)\n অধ্যাপক ও বিভাগীয় প্রধান, শিশু বিভাগ, ঢাকা শিশু হাসপাতাল\n প্রিন্সিপ্যাল (প্রাক্তন) আশিয়ান মেডিকেল কলেজ\n কন্সালটেন্ট (প্রাক্তন) ইউনাইটেড হাসপাতাল',
      time: 'সন্ধ্যা ৬টা থেকে ৮টা পর্যন্ত (রবি, মঙ্গল, ও বৃহস্পতিবার)'
    },
      {
      name: 'ডা. নাজমা খাতুন',
      description: 'এমবিবিএস (ময়মনসিংহ মেডিকেল কলেজ), ডিসিএইচ (বি.এস.এম.এম.ইউ), এফসিপিএস (এফপি)\nচাইল্ড স্পেশালিস্ট, কনসালট্যান্ট, ডা. এম আর খান শিশু হাসপাতাল ও আইসিএইচ মিরপুর, ঢাকা',
      time: ''
    },
    
  ],
    'অর্থোপেডিকস, ট্রমা ও স্পাইন বিশেষজ্ঞ ও সার্জন': [
    {
      name: 'ডা.নিবরাস ওয়াদুদ খান',
      description: 'এমবিবিএস (চট্টগ্রাম), এফসিপিএস পার্ট-১, অর্থোপেডিক সার্জারি, এমআরসিএস পার্ট-১ (ইংল্যান্ড) \nসার্জারী বিভাগ, ঢাকা মেডিকেল কলেজ হাসপাতাল\nবিএমডিসি রেজি: নং এ-১২০৪৭৯',
      time: 'রাত ৮টা থেকে রাত ১০টা (শনি, সোম ও বুধবার)',
    },
  ],
     'নাক কান গলা রোগ বিশেষজ্ঞ': [
    {
      name: 'ডা.রাহাত তানভীর আনোয়ার',
      description: 'এমবিবিএস (ডিএমসি), বিসিএস (স্বাস্থ্য), এমসিপিএস, এফসিপিএস \nনাক কান গলা রোগ বিশেষজ্ঞ, মাইক্রোস্কোপিক, এন্ডোস্কোপিক ও হেড নেক সার্জন \nজাতীয় নাক কান গলা ইনস্টিটিউট, তেজগাঁও, ঢাকা \nনাকের এন্ডোস্কোপিক সার্জারিতে উচ্চতর প্রশিক্ষণপ্রাপ্ত (চাংগী জেনারেল হাসপাতাল, সিঙ্গাপুর) কানের মাইক্রোসকপিক সার্জারিতে উচ্চতর প্রশিক্ষণপ্রাপ্ত',
      time: 'বিকেল ৫:৩০মিঃ থেকে সন্ধ্যা ৭:৩০মি (শনি, সোম ও বুধবার)',
    },
  ],
    'চর্ম, যৌন ও এলার্জি রোগ বিশেষজ্ঞ': [
    {
      name: 'ডা.বাবু রাম মন্ডল',
      description: 'এমবিবিএস (ডিএমসি), বিসিএস (স্বাস্থ্য) এমডি (ডার্মাটোলজী) কোর্স\nবাংলাদেশ মেডিকেল বিশ্ববিদ্যালয়। (পিজি হাসপাতাল)',
      time: 'বিকেল ৫টা থেকে রাত ৮টা (শুক্রবার বন্ধ)',
    },
  ],
   'ক্লিনিক্যাল প্যাথলজিস্ট': [
    {
      name: 'লেফটেন্যান্ট কর্নেল ডাঃ মোঃ মুখলেছুর রহমান খান (অব.)',
      description: 'এমবিবিএস (ঢাকা), এমসিপিএস (বিডি), ডিসিপি (বিএসএমএমইউ) \nপ্রাক্তন প্রধান, ক্লিনিকাল প্যাথলজি, এএফআইপি ঢাকা সেনানিবাস\nকনসালটেন্ট প্যাথলজিস্ট (আশ্-শাফি মেডিকেল সেন্টার)',
      time: '',
    },
  ],
   'মেডিসিন, বক্ষব্যাধি, অ্যাজমা, এলার্জি, শ্বাসকষ্ট ও যক্ষা রোগ বিশেষজ্ঞ': [
    {
      name: 'ডা. মোঃ আশরাফুল ইসলাম (সজিব)',
      description: 'এমবিবিএস, বিসিএস (স্বাস্থ্য সিসিডি, ডায়াবেটিস (বারডেম), এম ডি (বক্ষব্যাধি)\nজাতীয় বক্ষব্যাধি ইনস্টিটিউট ও হাসপাতাল মহাখালী, ঢাকা। বিএমডিসি রেজি. নং- ৭৩২৬৯',
      time: '',
    },
  ],
  'ইউরোলজি ও মেডিসিন বিশেষজ্ঞ': [
    {
      name: 'ডা. মাহমুদ হাসান',
      description: 'এমবিবিএস, বিসিএস (স্বাস্থ্য)\nএমডি কার্ডিওলজি (অন কোর্স), পিজিটি (মেডিসিন)\nজাতীয় ইউরোলজি ইনস্টিটিউট, ঢাকা।',
      time: '',
    },
  ],
  'নিউরোমেডিসিন': [
    {
      name: 'ডা. আনামিকা মারজিয়া মৌসুমী',
      description: 'এমবিবিএস (ঢাকা), বিসিএস (স্বাস্থ্য)\nপিজিটি (মেডিসিন)\nএফসিপিএস (নিউরোমেডিসিন, এফপি)\nন্যাশনাল ইনস্টিটিউট অব নিউরোসায়েন্সেস ও হাসপাতাল।',
      time: '',
    },
  ],
  
};

export default function DoctorsPage() {
  const specialties = Object.keys(doctors);

  return (
    <div>
      
        
    <div className="pt-1 pb-1 flex flex-col sm:flex-row items-center justify-center gap-2 bg-green-600 text-white px-4">
       <Image src="Logo[2].png" alt="Ash Shafi Logo" width={70} height={70} className="w-12 h-12 sm:w-[70px] sm:h-[70px]" />
      <span className="text-sm sm:text-base font-extrabold text-center">ডাক্তার এর সিরিয়াল দিতে কল করুন : </span>
      <div className="flex flex-col sm:flex-row items-center gap-2 sm:gap-3">
        <a
        href="tel:+8801346694684"
        className="flex items-center gap-2 hover:text-green-200 transition-colors text-sm sm:text-base"
        >
        <svg
          xmlns="http://www.w3.org/2000/svg"
          className="w-4 h-4"
          fill="none"
          viewBox="0 0 24 24"
          stroke="currentColor"
          strokeWidth={2}
          aria-hidden="true"
        >
          <path
          strokeLinecap="round"
          strokeLinejoin="round"
          d="M3 5a2 2 0 012-2h2.5a1 1 0 01.95.68l1 3a1 1 0 01-.25 1.02L8.2 9.8a11 11 0 005 5l1.1-1.05a1 1 0 011.02-.25l3 .95A1 1 0 0121 16.5V19a2 2 0 01-2 2A16 16 0 013 5z"
          />
        </svg>
        <span>+8801346694684</span>
        </a>

        <a
        href="tel:+8801992568186"
        className="flex items-center gap-2 hover:text-green-200 transition-colors text-sm sm:text-base"
        >
        <svg
          xmlns="http://www.w3.org/2000/svg"
          className="w-4 h-4"
          fill="none"
          viewBox="0 0 24 24"
          stroke="currentColor"
          strokeWidth={2}
          aria-hidden="true"
        >
          <path
          strokeLinecap="round"
          strokeLinejoin="round"
          d="M3 5a2 2 0 012-2h2.5a1 1 0 01.95.68l1 3a1 1 0 01-.25 1.02L8.2 9.8a11 11 0 005 5l1.1-1.05a1 1 0 011.02-.25l3 .95A1 1 0 0121 16.5V19a2 2 0 01-2 2A16 16 0 013 5z"
          />
        </svg>
        <span>+8801992568186</span>
        </a>
      </div>
      </div>

      <section className="py-12 bg-gray-50">
        <div className="container mx-auto px-4">
          <h2 className="text-3xl font-bold text-center mb-8">
            আশ্‌-শাফি মেডিকেল সেন্টারের বিশেষজ্ঞ ডাক্তার এর তালিকা
          </h2>
          <Accordion
            type="single"
            collapsible
            className="w-full max-w-4xl mx-auto space-y-4"
          >
            {specialties.map((specialty, index) => (
              <AccordionItem
                key={specialty}
                value={`item-${index}`}
                className="bg-white rounded-lg shadow-sm"
              >
                <AccordionTrigger className="px-6 py-4 text-lg text-left hover:text-green-600">
                  {specialty}
                </AccordionTrigger>
                <AccordionContent className="px-6 pb-6">
                  <div className="space-y-4">
                    {doctors[specialty].map((doctor, dIndex) => (
                      <Card
                        key={dIndex}
                        className="border-l-4 border-green-500"
                      >
                        <CardContent className="p-4">
                          <h3 className="text-xl font-semibold mb-1">
                            {doctor.name}
                          </h3>
                          <p className="text-gray-700 whitespace-pre-line mb-2">
                            {doctor.description}
                          </p>
                          {doctor.time && (
                            <p className="text-green-600 font-medium">
                              সময়: {doctor.time}
                            </p>
                          )}
                        </CardContent>
                      </Card>
                    ))}
                  </div>
                </AccordionContent>
              </AccordionItem>
            ))}
          </Accordion>
          <div className="mt-8 flex justify-center">
            <div className="relative">
              <span className="absolute -inset-1 rounded-full bg-gradient-to-r from-green-300 via-green-400 to-green-500 opacity-60 blur-xl animate-pulse" />
              <a
                href="https://res.cloudinary.com/dz8e6wjnx/image/upload/v1762366861/lab_test_fee_page-0001_kqtssu.jpg"
                role="button"
                aria-label="অ্যাপয়েন্টমেন্ট বুক করুন"
                className="relative z-10 inline-block px-8 py-3 bg-green-600 text-white font-semibold rounded-full shadow-lg transform transition duration-200 hover:scale-105 focus:outline-none focus:ring-4 focus:ring-green-300"
              >
                ল্যাব টেস্ট এবং ফি সম্পর্কে বিস্তারিত জানতে এখানে ক্লিক করুন
              </a>
            </div>
          </div>
        </div>
      </section>
      
      <PackagesSection />
    </div>

  );
}


function PackagesSection() {
  return (
    <section className="py-8 sm:py-12 bg-white">
      <div className="container mx-auto px-4">
        <h2 className="text-2xl sm:text-3xl font-bold text-center mb-6 sm:mb-8">
          আমাদের প্যাকেজসমূহ
        </h2>
        <div className="flex justify-center">
          <Image
            src="/packages.png"
            alt="আমাদের প্যাকেজসমূহ"
            width={800}
            height={800}
            className="rounded-lg shadow-lg w-full max-w-xs sm:max-w-md md:max-w-lg lg:max-w-2xl h-auto"
          />
        </div>
      </div>
    </section>
  );
}