import type { Doctor } from '@/types/doctor';

// Doctor data grouped by specialization
export const doctors: Record<string, Doctor[]> = {
  'মেডিসিন বিশেষজ্ঞ': [
    {
      name: 'ডা. রুম্মানা সিরাজ',
      description: 'এমবিবিএস (ডিএমসি), এফসিপিএস (মেডিসিন), বিসিএস (স্বাস্থ্য)\nসহকারী অধ্যাপক (মেডিসিন)\nমুগদা মেডিকেল কলেজ হাসপাতাল, মুগদা, ঢাকা\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: '',
    },
    {
      name: 'ডা. এম এ মোহাইমেন ইবনে মোস্তাফিজ',
      description: 'এমবিবিএস (এএফএমসি, ঢাকা), বিসিএস (স্বাস্থ্য), এফসিপিএস (মেডিসিন) শেষ পর্ব\nকুর্মিটোলা জেনারেল হাসপাতাল, ঢাকা\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: '',
    },
  ],
  'মেডিসিন ও ডায়াবেটিস বিশেষজ্ঞ': [
    {
      name: 'ডা. নাহিদ ফারহানা চৌধুরী',
      description: 'এমবিবিএস (ঢাকা) এফসিজিপি, সিসিডি (বারডেম), ডিএমইউ \nকনসালটেন্ট\nফ্যামিলি মেডিসিন ও ডায়াবেটিস বিশেষজ্ঞ\nপ্রাক্তন ক্লিনিক ইনচার্জ, সূর্যের হাসি ক্লিনিক\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: '',
    },
    {
      name: 'ডা. মোঃ তানজীর আনোয়ার',
      description: 'এমবিবিএস, বিসিএস (স্বাস্থ্য), এফসিজিপি সিসিডি (বারডেম), সি-কার্ড (ন্যাশনাল হার্ট ফাউন্ডেশন) সিডিডি (আইসিডিডিআরবি) এমডি (ইন্টারনাল মেডিসিন) (অন কোর্স)\nজনস্বাস্থ্য পুষ্টি প্রতিষ্ঠান, ঢাকা\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: 'বিকেল ৫টা থেকে সন্ধ্যা ৭টা (শুক্রবার বন্ধ)',
    },
    {
      name: 'ডা. মুহম্মদ যুবায়ের চৌধুরী',
      description: 'এমবিবিএস, সিসিডি (বারডেম), এমপিএইচ \nকনসালটেন্ট পাবলিক হেলথ্ এবং ডায়াবেটোলজিস্ট\n ল্যাব এইড কার্ডিয়াক হাসপাতাল\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: 'সকাল ১০টা থেকে দুপুর ১টা (শনি, রবি, সোম ও বৃহস্পতিবার)',
    },
      {
      name: 'ডা. এম এ মোহাইমেন ইবনে মোস্তাফিজ',
      description: 'এমবিবিএস (এএফএমসি, ঢাকা), বিসিএস (স্বাস্থ্য), এফসিপিএস (মেডিসিন) শেষ পর্ব, কুর্মিটোলা জেনারেল হাসপাতাল, ঢাকা\n কনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: '',
    },
  ],
  'মেডিসিন ডায়াবেটিস ও কিডনি রোগে বিশেষজ্ঞ': [
    {
      name: 'ডা. তাসনীম আলম',
      description: 'এমবিবিএস, সিসিডি (বারডেম), এফসিপিএস (মেডিসিন) শেষ পর্ব , এমডি (নেফ্রোলজি) কোর্স, মেডিসিন ডায়াবেটিস ও কিডনি রোগে বিশেষ প্রশিক্ষণপ্রাপ্ত\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: '',
    },
  ],
  'পরিপাকতন্ত্র ও লিভার রোগ বিশেষজ্ঞ': [
    {
      name: 'ডা. আল মাহমুদ এ্যাপোলো',
      description: 'এমবিবিএস (ডিএমসি), বিসিএস (স্বাস্থ্য) এমডি (গ্যাস্ট্রোএন্টোরোলজী)\nপরিপাকতন্ত্র ও লিভার রোগ বিশেষজ্ঞ কনসালটেন্ট, গ্যাস্ট্রোএন্টোরোলজী\nজাতীয় গ্যাস্ট্রোলিভার ইনস্টিটিউট ও হাসপাতাল, মহাখালী, ঢাকা\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: 'রাত ৮টা থেকে রাত ৯:৩০মি: (রবি, মঙ্গল ও বৃহস্পতিবার)',
    },
  ],
  'প্রসূতি ও স্ত্রীরোগ বিশেষজ্ঞ': [
    {
      name: 'ডা. ফারহানা মিথিলা',
      description: 'এমবিবিএস, এফসিপিএস প্রসূতি ও স্ত্রীরোগ বিশেষজ্ঞ \nল্যাপারোস্কোপিক সার্জন\n বন্ধ্যাত্ব বিষয়ে উচ্চতর প্রশিক্ষণপ্রাপ্ত\nঢাকা মেডিকেল কলেজ হাসপাতাল\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: 'সন্ধ্যা ৭টা থেকে রাত ৯টা (শনি, রবি, মঙ্গল ও বৃহস্পতিবার)',
    },
  
    {
      name: 'ডা. লুসিয়াত জাহান',
      description: 'এমবিবিএস (আরইউ), ডিএমইউ, সিএমইউ, প্রাক্তন-ক্লিনিক ম্যানেজার (ইউপিএইচসিএসডিপি-২)\n(আরবান প্রাইমারী হেলথ কেয়ার সার্ভিসেস ডেলিভারি প্রোজেক্ট-২)\nপ্রাক্তন-মেডিকেল অফিসার\nসূর্যের হাসি ক্লিনিক\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: 'প্রতিদিন সকাল ১০ টা-দুপুর ১ টা পর্যন্ত (শুক্রবার বন্ধ)',
    },
    {
      name: 'ডা. ফারহানা ফেরদৌস',
      description: 'এমবিবিএস, বিসিএস (স্বাস্থ্য), ডিজিও (গাইনি-অবস্‌), এফসিপিএস (গাইনি-অবস্‌, এফপি)\nশহীদ সোহরাওয়ার্দী মেডিকেল কলেজ ও হাসপাতাল,শের-ই-বাংলা নগর, ঢাকা\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: 'সন্ধ্যা ৬ টা থেকে রাত ৮ টা (সোম, মঙ্গল ও বুধবার)',
    },
  ],
  
  'চর্ম, যৌন ও এলার্জি রোগ বিশেষজ্ঞ': [
    {
      name: 'ডা.বাবু রাম মন্ডল',
      description: 'এমবিবিএস (ডিএমসি), বিসিএস (স্বাস্থ্য) এমডি (ডার্মাটোলজী) কোর্স\nবাংলাদেশ মেডিকেল বিশ্ববিদ্যালয়। (পিজি হাসপাতাল)\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: 'বিকেল ৫টা থেকে রাত ৮টা (শুক্রবার বন্ধ)',
    },
  ],


  'জেনারেল, ল্যাপারোস্কোপ, হার্নিয়া, ব্রেস্ট এন্ড ট্রমা সার্জারী বিশেষজ্ঞ': [
    {
      name: 'ডা. মোস্তাক আহমেদ',
      description: 'এমবিবিএস, এফসিপিএস (সার্জারী) \nজেনারেল, ল্যাপারোস্কোপ, হার্নিয়া, ব্রেস্ট এন্ড ট্রমা সার্জারী বিশেষজ্ঞ,ঢাকা মেডিকেল কলেজ হাসপাতাল\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: 'সন্ধ্যা ৭টা থেকে রাত ৯টা (রবি, মঙ্গল ও বৃহস্পতিবার)',
    },

  ],
  'জেনারেল, কলোরেক্টাল, ব্রেষ্ট, ইউরোলজী ও ক্যান্সার বিশেষজ্ঞ ল্যাপারোস্কপিক সার্জন': [
    {
      name: 'ডা. মোঃ মাহমুদুল হাসান (মিঠু)',
      description: 'এমবিবিএস, বিসিএস (স্বাস্থ্য), এফসিপিএস (সার্জারি)\nএফসিপিএস (সার্জিক্যাল অনকোলজি) কোর্স কনসালটেন্ট (সার্জারী)\nজেনারেল, কলোরেক্টাল, ব্রেষ্ট, ইউরোলজী ও ক্যান্সার বিশেষজ্ঞ ল্যাপারোস্কপিক সার্জন\nজাতীয় ক্যান্সার গবেষণা ইনস্টিটিউট ও হাসপাতাল, মহাখালী, ঢাকা\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: '',
    },
  ],
  'হৃদরোগ ও মেডিসিন বিশেষজ্ঞ': [
    {
      name: 'ডা.মাহমুদ হাসান',
      description: 'এমবিবিএস, বিসিএস (স্বাস্থ্য), এমডি কার্ডিওলজি (অন কোর্স), পিজিটি (মেডিসিন) \nজাতীয় হৃদরোগ ইনস্টিটিউট, ঢাকা\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: 'সন্ধ্যা ৬টা থেকে রাত ৮টা (শনি, রবি, মঙ্গল ও বুধবার)',
    },
    {
      name: 'ডা.মোহাম্মদ ইব্রাহীম আদহাম',
      description: 'এমবিবিএস (ডিএমসি), এমএস রেসিডেন্ট (সিভিটিএস, এনএইচএফএইচ এন্ড আরআই) এফসিপিএস পার্ট-২ ট্রেইনি (সার্জারী), এমআরসিএস ওএসসিই (ইডেনবার্গ), সিসিডি (বারডেম) বিশেষ প্রশিক্ষণপ্রাপ্ত ইকো, ফুটকেয়ার ও ইনজুরি ব্যবস্থাপনা, প্রাক্তন এসআরএমও, ল্যাব এইড কার্ডিয়াক হাসপাতাল\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: 'বিকেল ৪টা-রাত ৯টা (রবি, মঙ্গল, বৃহস্পতি ও শুক্রবার)',
    },
    {
      name: 'ডা. ফারিয়া রহমান',
      description: 'এমবিবিএস (ঢাকা), এমডি (কার্ডিওলজি, ন্যাশনাল হার্ট ফাউন্ডেশন), এফসিপিএস (মেডিসিন) শেষ পর্ব\nকনসালটেন্ট, কার্ডিওলজি, জাতীয় হৃদরোগ ইনস্টিটিউট ও হাসপাতাল\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: '',
    },
  ],
  'নবজাতক, শিশু ও কিশোর রোগ বিশেষজ্ঞ': [
    {
      name: 'ডা.মোঃ মাজহারুল হক',
      description: 'এমবিবিএস (সিলেট মেডিকেল কলেজ) ডিসিএইচ (ঢাকা শিশু হাসপাতাল, শ্যামলী) পিজিপিএন (বোষ্টন ইউনিভার্সিটি) ফেলোশিপ, শিশু পুষ্টি (আমেরিকা)\nকনসালটেন্ট, পেডিয়াট্রিক্স ও এনআইসিইউ, ওজিএসবি হাসপাতাল\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: 'রাত ৮টা থেকে ১০টা পর্যন্ত (শনি, সোম ও বুধবার)',
    },
    {
      name: 'ডা. মোহাম্মদ মাসুদ রানা',
      description: 'এমবিবিএস (ঢাকা), পিজিটি (চাইল্ড মেডিসিন) পিজিপিএন পোষ্ট গ্রাজুয়েশন ইন পেডিয়াট্রিক নিউট্রিশন, সিসিডি (হার্ট ফাউন্ডেশন), সিসিডি (বারডেম) \nশিশু চিকিৎসক ও জেনারেল,ফিজিশিয়ান প্রাক্তন সিনিয়র মেডিকেল অফিসার \nইনস্টিটিউট অব চাইল্ড হেলথ্ এন্ড শিশু ফাউন্ডেশন হাসপাতাল\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: 'সকাল ৯টা থেকে দুপুর ১১টা (শুক্রবার বন্ধ)',
    },
    {
      name: 'প্রফেশনাল চৌধুরী মোহাঃ হায়দার আলী',
      description: 'এমবিবিএস (ডিএমসি) ডিসিএইচ (Dublin), আরসিপিএন্ডএস (Ireland), এমডি (শিশু-বাংলাদেশ শিশু ইনস্টিটিউট)\n অধ্যাপক ও বিভাগীয় প্রধান, শিশু বিভাগ, ঢাকা শিশু হাসপাতাল\n প্রিন্সিপ্যাল (প্রাক্তন) আশিয়ান মেডিকেল কলেজ\n কন্সালটেন্ট (প্রাক্তন) ইউনাইটেড হাসপাতাল\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: 'সন্ধ্যা ৬টা থেকে ৮টা পর্যন্ত (রবি, মঙ্গল, ও বৃহস্পতিবার)'
    },
    {
      name: 'ডা. নাজমা খাতুন',
      description: 'এমবিবিএস (ময়মনসিংহ মেডিকেল কলেজ), ডিসিএইচ (বি.এস.এম.এম.ইউ), এফসিপিএস (এফপি)\nচাইল্ড স্পেশালিস্ট, কনসালট্যান্ট, ডা. এম আর খান শিশু হাসপাতাল ও আইসিএইচ মিরপুর, ঢাকা\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: 'প্রতিদিন সন্ধ্যা ৬ টা-রাত ৮ টা (শুক্রবার বন্ধ)'
    },
    {
      name: 'ডা. অন্তরা তালুকদার',
      description: 'एमबीबीएस (ঢাকা), ডিসিএইচ (বিএমইউ), এফসিপিএস (শিশু গ্যাস্ট্রো ও নিউট্রিশন) শেষ পর্ব\nবাংলাদেশ শিশু হাসপাতাল ও ইনস্টিটিউট\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: 'সন্ধ্যা ৬ টা-রাত ৮ টা (শনি, সোম ও বুধবার)'
    },

  ],
  'অর্থোপেডিকস, ট্রমা ও স্পাইন বিশেষজ্ঞ ও সার্জন': [
    {
      name: 'ডা.নিবরাস ওয়াদুদ খান',
      description: 'এমবিবিএস (চট্টগ্রাম), এফসিপিএস পার্ট-১, অর্থোপেডিক সার্জারি, এমআরসিএস পার্ট-১ (ইংল্যান্ড) \nসার্জারী বিভাগ, ঢাকা মেডিকেল কলেজ হাসপাতাল\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: 'রাত ৮টা থেকে রাত ১০টা (শনি, সোম ও বুধবার)',
    },
    {
      name: 'ডা. মোঃ আরিফুল ইসলাম',
      description: 'এমবিবিএস, বিসিএস (স্বাস্থ্য), এমএস (অর্থোপেডিক সার্জারি), এও (বেসিক), এওএ (বেসিক), অর্থোপেডিক ও ট্রমা বিশেষজ্ঞ সার্জন\nকনসালট্যান্ট, জাতীয় অর্থোপেডিক হাসপাতাল ও পুনর্বাসন প্রতিষ্ঠান (নিটোর), সাবেক পঙ্গু হাসপাতাল, শের-এ-বাংলা নগর, ঢাকা',
      time: 'রাত ৮টা থেকে রাত ১০টা (শনি, রবি, মঙ্গল ও বৃহস্পতিবার)',
    },
  ],
  'নাক কান গলা রোগ বিশেষজ্ঞ': [
    {
      name: 'ডা.রাহাত তানভীর আনোয়ার',
      description: 'এমবিবিএস (ডিএমসি), বিসিএস (স্বাস্থ্য), এমসিপিএস, এফসিপিএস \nনাক কান গলা রোগ বিশেষজ্ঞ, মাইক্রোস্কোপিক, এন্ডোস্কোপিক ও হেড নেক সার্জন \nজাতীয় নাক কান গলা ইনস্টিটিউট, তেজগাঁও, ঢাকা \nনাকের এন্ডোস্কোপিক সার্জারিতে উচ্চতর প্রশিক্ষণপ্রাপ্ত (চাংগী জেনারেল হাসপাতাল, সিঙ্গাপুর) কানের মাইক্রোসকপিক সার্জারিতে উচ্চতর প্রশিক্ষণপ্রাপ্ত\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: 'বিকেল ৫:৩০মিঃ থেকে সন্ধ্যা ৭:৩০মি (শনি, সোম ও বুধবার)',
    },
  ],

 
  'মেডিসিন, বক্ষব্যাধি, অ্যাজমা, এলার্জি, শ্বাসকষ্ট ও যক্ষা রোগ বিশেষজ্ঞ': [
    {
      name: 'ডা. মোঃ আশরাফুল ইসলাম (সজিব)',
      description: 'এমবিবিএস, বিসিএস (স্বাস্থ্য সিসিডি, ডায়াবেটিস (বারডেম), এম ডি (বক্ষব্যাধি)\nজাতীয় বক্ষব্যাধি ইনস্টিটিউট ও হাসপাতাল মহাখালী, ঢাকা\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: '',
    },
  ],
  
  'নিউরোমেডিসিন': [
    {
      name: 'ডা. অনামিকা মারজিয়া মৌসুমী',
      description: 'এমবিবিএস (ঢাকা), বিসিএস (স্বাস্থ্য)\nপিজিটি (মেডিসিন)\nএফসিপিএস (নিউরোমেডিসিন, এফপি)\nন্যাশনাল ইনস্টিটিউট অব নিউরোসায়েন্সেস ও হাসপাতাল\nকনসালটেন্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: '',
    },
  ],
  'সনোলজিস্ট': [
    {
      name: 'ডা. জিনিয়া আফরিন খান',
      description: 'এমবিবিএস (ঢাকা), সিসিডি (বারডেম), ডিএমইডি \nসহকারী অধ্যাপক, ন্যাশনাল ইনস্টিটিউট অব নিউক্লিয়ার মেডিসিন এন্ড এ্যালাইড সাইন্সেস, বাংলাদেশ পরমাণু শক্তি কমিশন\nকনসালটেন্ট সোনোলজিস্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: 'সন্ধ্যা ৭ টা থেকে রাত ৯ টা (রবি, সোম ও মঙ্গলবার)',
    },
    {
      name: 'ডা. বুসরা এনায়েত করিম',
      description: 'এমবিবিএস (ডিইউ), সিএমইউ, ডিএমইউ\nস্পেশাল ট্রেনিং on এনোমালি স্ক্যান এন্ড ভাসকুলার কালার ডপলার \nকনসালটেন্ট সোনোলজিস্ট, আশ্-শাফি মেডিকেল সেন্টার',
      time: 'প্রতিদিন সকাল ৯ টা থেকে ১ টা পর্যন্ত',
    },
    {
      name: 'ডা. শাহানা আক্তার',
      description: 'এমবিবিএস, ডিডিএমইডি, এমডিএমইডি, সিসিডি, অ্যাডভান্সড ট্রেনিং অন এনোমালি স্ক্যান টিএফএ, ব্রেস্ট, থাইরয়েড ও এমএসকে\nকনসালট্যান্ট সোনোলজিস্ট আশ্-শাফি মেডিকেল সেন্টার',
      time: 'সন্ধ্যা ৬ টা থেকে রাত ৯ টা (শনি, বুধ ও বৃহস্পতিবার)',
    },
    
  ],
   'ক্লিনিক্যাল প্যাথলজিস্ট': [
    {
      name: 'লেফটেন্যান্ট কর্নেল ডাঃ মোঃ মুখলেছুর রহমান খান (অব.)',
      description: 'এমবিবিএস (ঢাকা), এমসিপিএস (বিডি), ডিসিপি (বিএসএমএমইউ) \nপ্রাক্তন প্রধান, ক্লিনিকাল প্যাথলজি, এএফআইপি ঢাকা সেনানিবাস\nকনসালটেন্ট প্যাথলজিস্ট (আশ্-শাফি মেডিকেল সেন্টার)',
      time: '',
    },
  ],
};
